In [1]:
import numpy as np
import pandas as pd

In [6]:
col = pd.read_csv("../collision.csv",dtype={'case_id': str})

C:\Users\Harold\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [7]:
party = pd.read_csv("../party.csv",dtype={'case_id': str})

C:\Users\Harold\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (4,13) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [2]:
from sqlalchemy import create_engine

In [7]:
DIALECT = 'oracle'
SQL_DRIVER = 'cx_oracle'
USERNAME = 'C##DB2021_G24' #enter your username
PASSWORD = 'DB2021_G24' #enter your password
HOST = 'cs322-db.epfl.ch' #enter the oracle db host url
PORT = 1521 # enter the oracle port number
SERVICE = 'ORCLCDB' # enter the oracle db service name
ENGINE_PATH_WIN_AUTH = DIALECT + '+' + SQL_DRIVER + '://' + USERNAME + ':' + PASSWORD +'@' + HOST + ':' + str(PORT) + '/?service_name=' + SERVICE

engine = create_engine(ENGINE_PATH_WIN_AUTH, max_identifier_length=128)

In [5]:
import cx_Oracle
cx_Oracle.init_oracle_client(lib_dir=r"C:\Program Files\Oracle\instantclient_19_10")

In [10]:
test_df = pd.read_sql_query('SELECT * FROM vehicle', engine)

In [11]:
display(test_df)

      statewide_vehicle_type          vehicle_make  vehicle_year  vehicle_id
0                          A  FORD                        2000.0           0
1                          A  BUICK                       1992.0           1
2                          D  TOYOTA                         NaN           2
3                          A  FORD                        1995.0           3
4                          D                  None           NaN           4
...                      ...                   ...           ...         ...
22873                      F  MISCELLANEOUS               1937.0       22873
22874                      D  PORSCHE                     1986.0       22874
22875                      J  AMERICAN MOTORS             1997.0       22875
22876                      A  OTHER FOREIGN               1926.0       22876
22877                      A  OLDSMOBILE                  1933.0       22877

[22878 rows x 4 columns]